<?php

declare(strict_types=1);

return [
    'register_success' => 'Користувач успішно зареєстрований. Будь ласка, перевірте свою електронну пошту для підтвердження.',
    'login_success' => 'Вхід успішний.',
    'logout_success' => 'Вихід успішний.',
    'logout_failed' => 'Вихід не вдався.',
    'token_required' => 'Токен обов’язковий.',
    'token_refreshed' => 'Токен успішно оновлено.',
    'failed'   => 'Вказані облікові дані не збігаються з нашими записами.',
    'password' => 'Пароль невірний.',
    'throttle' => 'Забагато спроб входу. Будь ласка, спробуйте ще раз, через :seconds секунд.',
    'user_save_failed' => 'Не вдалося зберегти користувача.',
    'invalid_login' => 'Неправильний логін або пароль.',
    'google_data_failed' => 'Не вдалося отримати дані від Google.',
    'github_data_failed' => 'Не вдалося отримати дані від GitHub.',
    'email_already_verified' => 'Вашу електронну пошту вже підтверджено.',
    'verification_email_sent' => 'Лист для підтвердження успішно надіслано.',
    'user_not_found' => 'Користувача не знайдено.',
    'invalid_verification_link' => 'Недійсне посилання для підтвердження.',
];
