<?php

return [
    'token_creation_failed' => 'Не вдалося створити токен.',
    'authentication_failed' => 'Не вдалося аутентифікувати користувача. Токен може бути недійсним або застарілим.',
    'logout_failed' => 'Не вдалося виконати вихід. Токен може бути недійсним або вже анульованим.',
    'token_refresh_failed' => 'Не вдалося оновити токен.',
    'invalid_refresh_token' => 'Недійсний токен для оновлення.',
    'refresh_token_creation_failed' => 'Не вдалося створити токен для оновлення.',
];
